Feature: CreateTicket feature
	Feature за добавяне на нов тикет към съпорт центнъра
	
	Scenario: Добавяне на тикет с валидни данни
	Given потребителят отваря прозорец за създаване на тикет
	When потребителят въвежда заглавие "Тест 1"
	And потребителят въвежда описание "Имам проблеми"
	And потребителят въвежда дата на проблема "12.12.2020"
	And потребителят въвежда статус на тикета "Активен"
	And потребителят натиска бутон за добавяне
	Then вижда съобщение с текст "Заявката е успешно регистрирана!"
	
	Scenario: Липсващо валидно заглавие
	Given потребителят отваря прозорец за създаване на тикет
	When потребителят въвежда описание "Имам много проблеми"
	And потребителят въвежда дата на проблема "13.01.2002"
	And потребителят въвежда статус на тикета "Забавен"
	And потребителят натиска бутон за добавяне
	Then вижда съобщение с текст "Моля въведете заглавие!"
	
	Scenario: Липсваща описание на тикета
	Given потребителят отваря прозорец за създаване на тикет
	When потребителят въвежда заглавие "Проблемче"
	And потребителят въвежда дата на проблема "25.06.2012"
	And потребителят въвежда статус на тикета "Активен"
	And потребителят натиска бутон за добавяне
	Then вижда съобщение с текст "Моля въведете описание на тикета!"
	
	Scenario: Липсваща дата на проблема на тикета
	Given потребителят отваря прозорец за създаване на тикет
	When потребителят въвежда заглавие "няколко проблема"
	And потребителят въвежда описание "мале много проблеми имам описани тук"
	And потребителят въвежда статус на тикета "Активен"
	And потребителят натиска бутон за добавяне
	Then вижда съобщение с текст "Моля въведете дата на тикета!"
	
	
	Scenario: Липсващ статус на тикета
	Given потребителят отваря прозорец за създаване на тикет
	When потребителят въвежда заглавие "Тест 15"
	And потребителят въвежда описание "Описание 15"
	And потребителят въвежда дата на проблема "15.07.1876"
	And потребителят натиска бутон за добавяне
	Then вижда съобщение с текст "Моля въведете статус на тикета!"
